# Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого предмета не обязательно
# были все типы занятий. Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
# Примеры строк файла:
# Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
#
# Пример словаря:
# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

dict ={}
with open("HW_6.txt", encoding="utf-8") as f:
    for i in f:
        name, info = i.split(':')
        el = [j for j in info if j ==' ' or (j >='0' and j <='9')]
        total_hours = sum(map(int, "".join(el).split()))
        dict[name] = total_hours

print(f"{dict}")